In [7]:
import pandas as pd
df_sales = pd.DataFrame({
    'Region': ['Kochi','Thrissur','Trivandrum', 'Kochi'],
    'Salesperson': ['Mohan','Vishal','Tinu', 'Roshan'],
    'Revenue': [30000, 25000, 32000, 15000]
})

In [62]:
df_sales.groupby('Region')['Revenue'].sum()

Region
Kochi         45000
Thrissur      25000
Trivandrum    32000
Name: Revenue, dtype: int64

In [66]:
df_sales.groupby(['Region', 'Salesperson'])['Revenue'].sum().groupby('Region').mean()

Region
Kochi         22500.0
Thrissur      25000.0
Trivandrum    32000.0
Name: Revenue, dtype: float64

In [40]:
df_employees = pd.DataFrame({
    'Department': ['HR','DEV','IT','DEV'],
    'Employee': ['Arun','Rohan','Franko','David'],
    'Salary': [40000,60000,30000,70000]
})

In [67]:
df_employees.groupby('Department').apply(lambda x: x.sort_values(by='Salary',ascending=False)).reset_index(drop=True).head(2)

C:\Users\mail2\AppData\Local\Temp\ipykernel_2380\1547471999.py:1: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df_employees.groupby('Department').apply(lambda x: x.sort_values(by='Salary',ascending=False)).head(2)

             Department Employee  Salary
Department
DEV        3        DEV    David   70000
           1        DEV    Rohan   60000

In [54]:
df_emp = pd.DataFrame({
    'EmpID': [101,102,103,104],
    'Name': ['Arun','Bibin','Basil','David'],
    'DepID': [201,202,201,203]
})

In [55]:
df_dep = pd.DataFrame({
    'DepID': [201,202,203,204],
    'DepName': ['HR','DEV','IT','DEV']
})

In [57]:
pd.merge(df_emp,df_dep, on='DepID', how='inner')

   EmpID   Name  DepID DepName
0    101   Arun    201      HR
1    102  Bibin    202     DEV
2    103  Basil    201      HR
3    104  David    203      IT

In [1]:
import pandas as pd

In [9]:
data = {'ID': [1, 2, 3, 4, 5, 6 ,7], 'Name': ['Alice', 'Bob', 'Charlie', 'Peter', 'Jose', 'Anna', 'Kevin'], 'Marks': [85, 92, 67, 78, 89, 96, 75]}

In [10]:
df = pd.DataFrame(data)

In [11]:
print(df)

   ID     Name  Marks
0   1    Alice     85
1   2      Bob     92
2   3  Charlie     67
3   4    Peter     78
4   5     Jose     89
5   6     Anna     96
6   7    Kevin     75

In [15]:
def assign_grade(marks):
    if marks >= 90:
        return 'A'
    elif marks >= 70 and marks < 89:
        return 'B'
    else:
        return 'C'

In [24]:
df['grade'] = df['Marks'].apply(assign_grade).reset_index(drop=True)

In [25]:
df

   ID     Name  Marks grade
0   1    Alice     85     B
1   2      Bob     92     A
2   3  Charlie     67     C
3   4    Peter     78     B
4   5     Jose     89     C
5   6     Anna     96     A
6   7    Kevin     75     B

In [35]:
df.to_csv('data.csv', index=False)

In [36]:
pd.read_csv('data.csv').head()

   ID     Name  Marks grade
0   1    Alice     85     B
1   2      Bob     92     A
2   3  Charlie     67     C
3   4    Peter     78     B
4   5     Jose     89     C

In [37]:
df.groupby(['Name','Marks']).agg({'Marks': ['sum','mean']})

              Marks
                sum  mean
Name    Marks
Alice   85       85  85.0
Anna    96       96  96.0
Bob     92       92  92.0
Charlie 67       67  67.0
Jose    89       89  89.0
Kevin   75       75  75.0
Peter   78       78  78.0

In [38]:
df[df['Marks'] >= 90]['Name']

1     Bob
5    Anna
Name: Name, dtype: object

In [42]:
df[(df['Marks'] >= 70) & (df['Marks'] < 89)]['Name']

0    Alice
3    Peter
6    Kevin
Name: Name, dtype: object

In [44]:
df[df['Marks'] < 70]['Name']

2    Charlie
Name: Name, dtype: object

In [45]:
df.drop(index=1, inplace=True)

In [46]:
df

   ID     Name  Marks grade
0   1    Alice     85     B
2   3  Charlie     67     C
3   4    Peter     78     B
4   5     Jose     89     C
5   6     Anna     96     A
6   7    Kevin     75     B

In [47]:
titanic_df = pd.read_csv('Titanic.csv')